RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_usart.c
  fractionaldivider = integerdivider - (100 * (tmpreg >> 4));

  if ((USARTx->CTLR1 & CTLR1_OVER8_Set) != 0)
  {
    tmpreg |= ((((fractionaldivider * 8) + 50) / 100)) & ((uint8_t)0x07);
  }
  else 
  {
    tmpreg |= ((((fractionaldivider * 16) + 50) / 100)) & ((uint8_t)0x0F);
  }
  
  USARTx->BRR = (uint16_t)tmpreg;
}

/*******************************************************************************
* Function Name  : USART_StructInit
* Description    : Fills each USART_InitStruct member with its default value.
* Input          : USART_InitStruct: pointer to a USART_InitTypeDef structure 
*      which will be initialized.
* Return         : None
*******************************************************************************/
void USART_StructInit(USART_InitTypeDef* USART_InitStruct)
{
  USART_InitStruct->USART_BaudRate = 9600;
  USART_InitStruct->USART_WordLength = USART_WordLength_8b;
  USART_InitStruct->USART_StopBits = USART_StopBits_1;
  USART_InitStruct->USART_Parity = USART_Parity_No ;
  USART_InitStruct->USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
  USART_InitStruct->USART_HardwareFlowControl = USART_HardwareFlowControl_None;  
}

/*******************************************************************************
* Function Name  : USART_ClockInit
* Description    : Initializes the USARTx peripheral Clock according to the 
*      specified parameters in the USART_ClockInitStruct .
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef
*      structure that contains the configuration information for the specified 
*      USART peripheral.
* Return         : None
*******************************************************************************/
void USART_ClockInit(USART_TypeDef* USARTx, USART_ClockInitTypeDef* USART_ClockInitStruct)
{
  uint32_t tmpreg = 0x00;
	
  tmpreg = USARTx->CTLR2;
  tmpreg &= CTLR2_CLOCK_CLEAR_Mask;
  tmpreg |= (uint32_t)USART_ClockInitStruct->USART_Clock | USART_ClockInitStruct->USART_CPOL | 
                 USART_ClockInitStruct->USART_CPHA | USART_ClockInitStruct->USART_LastBit;
  USARTx->CTLR2 = (uint16_t)tmpreg;
}

/*******************************************************************************
* Function Name  : USART_ClockStructInit
* Description    : Fills each USART_InitStruct member with its default value.
* Input          : USART_ClockInitStruct: pointer to a USART_ClockInitTypeDef
*      structure which will be initialized.
* Return         : None
*******************************************************************************/
void USART_ClockStructInit(USART_ClockInitTypeDef* USART_ClockInitStruct)
{
  USART_ClockInitStruct->USART_Clock = USART_Clock_Disable;
  USART_ClockInitStruct->USART_CPOL = USART_CPOL_Low;
  USART_ClockInitStruct->USART_CPHA = USART_CPHA_1Edge;
  USART_ClockInitStruct->USART_LastBit = USART_LastBit_Disable;
}

/*******************************************************************************
* Function Name  : USART_Cmd
* Description    : Enables or disables the specified USART peripheral.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void USART_Cmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR1 |= CTLR1_UE_Set;
  }
  else
  {
    USARTx->CTLR1 &= CTLR1_UE_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_ITConfig
* Description    : Enables or disables the specified USART interrupts.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_IT: specifies the USART interrupt sources to be enabled or disabled.
*                    USART_IT_CTS:  CTS change interrupt.
*                    USART_IT_LBD:  LIN Break detection interrupt.
*                    USART_IT_TXE:  Transmit Data Register empty interrupt.
*                    USART_IT_TC:   Transmission complete interrupt.
*                    USART_IT_RXNE: Receive Data register not empty interrupt.
*                    USART_IT_IDLE: Idle line detection interrupt.
*                    USART_IT_PE:   Parity Error interrupt.
*                    USART_IT_ERR:  Error interrupt.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void USART_ITConfig(USART_TypeDef* USARTx, uint16_t USART_IT, FunctionalState NewState)
{
  uint32_t usartreg = 0x00, itpos = 0x00, itmask = 0x00;
  uint32_t usartxbase = 0x00;

  if (USART_IT == USART_IT_CTS)
  {
  }   
  
  usartxbase = (uint32_t)USARTx;
  usartreg = (((uint8_t)USART_IT) >> 0x05);
  itpos = USART_IT & IT_Mask;
  itmask = (((uint32_t)0x01) << itpos);
    
  if (usartreg == 0x01) 
  {
    usartxbase += 0x0C;
  }
  else if (usartreg == 0x02) 
  {
    usartxbase += 0x10;
  }
  else 
  {
    usartxbase += 0x14; 
  }
	
  if (NewState != DISABLE)
  {
    *(__IO uint32_t*)usartxbase  |= itmask;
  }
  else
  {
    *(__IO uint32_t*)usartxbase &= ~itmask;
  }
}

/*******************************************************************************
* Function Name  : USART_DMACmd
* Description    : Enables or disables the USART DMA interface.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_DMAReq: specifies the DMA request.
*                    USART_DMAReq_Tx: USART DMA transmit request.
*                    USART_DMAReq_Rx: USART DMA receive request.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void USART_DMACmd(USART_TypeDef* USARTx, uint16_t USART_DMAReq, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR3 |= USART_DMAReq;
  }
  else
  {
    USARTx->CTLR3 &= (uint16_t)~USART_DMAReq;
  }
}

