RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_usart.c
/*******************************************************************************
* Function Name  : USART_SetAddress
* Description    : Sets the address of the USART node.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_Address: Indicates the address of the USART node.
* Return         : None
*******************************************************************************/
void USART_SetAddress(USART_TypeDef* USARTx, uint8_t USART_Address)
{
  USARTx->CTLR2 &= CTLR2_Address_Mask;
  USARTx->CTLR2 |= USART_Address;
}

/*******************************************************************************
* Function Name  : USART_WakeUpConfig
* Description    : Selects the USART WakeUp method.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_WakeUp: specifies the USART wakeup method.
*                    USART_WakeUp_IdleLine: WakeUp by an idle line detection.
*                    USART_WakeUp_AddressMark: WakeUp by an address mark.
* Return         : None
*******************************************************************************/
void USART_WakeUpConfig(USART_TypeDef* USARTx, uint16_t USART_WakeUp)
{
  USARTx->CTLR1 &= CTLR1_WAKE_Mask;
  USARTx->CTLR1 |= USART_WakeUp;
}

/*******************************************************************************
* Function Name  : USART_ReceiverWakeUpCmd
* Description    : Determines if the USART is in mute mode or not.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void USART_ReceiverWakeUpCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR1 |= CTLR1_RWU_Set;
  }
  else
  {
    USARTx->CTLR1 &= CTLR1_RWU_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_LINBreakDetectLengthConfig
* Description    : Sets the USART LIN Break detection length.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_LINBreakDetectLength: specifies the LIN break detection length.
*                    USART_LINBreakDetectLength_10b: 10-bit break detection.
*                    USART_LINBreakDetectLength_11b: 11-bit break detection.
* Return         : None
*******************************************************************************/
void USART_LINBreakDetectLengthConfig(USART_TypeDef* USARTx, uint16_t USART_LINBreakDetectLength)
{
  USARTx->CTLR2 &= CTLR2_LBDL_Mask;
  USARTx->CTLR2 |= USART_LINBreakDetectLength;  
}

/*******************************************************************************
* Function Name  : USART_LINCmd
* Description    : Enables or disables the USART LIN mode.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.
* Return         : None
*******************************************************************************/
void USART_LINCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR2 |= CTLR2_LINEN_Set;
  }
  else
  {
    USARTx->CTLR2 &= CTLR2_LINEN_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_SendData
* Description    : Transmits single data through the USARTx peripheral.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  Data: the data to transmit..
* Return         : None
*******************************************************************************/
void USART_SendData(USART_TypeDef* USARTx, uint16_t Data)
{
  USARTx->DATAR = (Data & (uint16_t)0x01FF);
}

/*******************************************************************************
* Function Name  : USART_ReceiveData
* Description    : Returns the most recent received data by the USARTx peripheral.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
* Return         : The received data.
*******************************************************************************/
uint16_t USART_ReceiveData(USART_TypeDef* USARTx)
{
  return (uint16_t)(USARTx->DATAR & (uint16_t)0x01FF);
}

/*******************************************************************************
* Function Name  : USART_SendBreak
* Description    : Transmits break characters.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
* Return         : None
*******************************************************************************/
void USART_SendBreak(USART_TypeDef* USARTx)
{
  USARTx->CTLR1 |= CTLR1_SBK_Set;
}

/*******************************************************************************
* Function Name  : USART_SetGuardTime
* Description    : Sets the specified USART guard time.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_GuardTime: specifies the guard time.
* Return         : None
*******************************************************************************/
void USART_SetGuardTime(USART_TypeDef* USARTx, uint8_t USART_GuardTime)
{    
  USARTx->GPR &= GPR_LSB_Mask;
  USARTx->GPR |= (uint16_t)((uint16_t)USART_GuardTime << 0x08);
}

/*******************************************************************************
* Function Name  : USART_SetPrescaler
* Description    : Sets the system clock prescaler.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_Prescaler: specifies the prescaler clock.
* Return         : None
*******************************************************************************/
void USART_SetPrescaler(USART_TypeDef* USARTx, uint8_t USART_Prescaler)
{ 
  USARTx->GPR &= GPR_MSB_Mask;
  USARTx->GPR |= USART_Prescaler;
}

/*******************************************************************************
* Function Name  : USART_SmartCardCmd
* Description    : Enables or disables the USART Smart Card mode.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.    
* Return         : None
*******************************************************************************/
void USART_SmartCardCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR3 |= CTLR3_SCEN_Set;
  }
  else
  {
    USARTx->CTLR3 &= CTLR3_SCEN_Reset;
  }
}

