RT-Thread/rt-thread/bsp/wch/arm/Libraries/CH32F10x_StdPeriph_Driver/StdPeriph_Driver/src/ch32f10x_usart.c
/*******************************************************************************
* Function Name  : USART_SmartCardNACKCmd
* Description    : Enables or disables NACK transmission.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.    
* Return         : None
*******************************************************************************/
void USART_SmartCardNACKCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR3 |= CTLR3_NACK_Set;
  }
  else
  {
    USARTx->CTLR3 &= CTLR3_NACK_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_HalfDuplexCmd
* Description    : Enables or disables the USART Half Duplex communication.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.    
* Return         : None
*******************************************************************************/
void USART_HalfDuplexCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR3 |= CTLR3_HDSEL_Set;
  }
  else
  {
    USARTx->CTLR3 &= CTLR3_HDSEL_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_OverSampling8Cmd
* Description    : Enables or disables the USART's 8x oversampling mode.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.    
* Return         : None
*******************************************************************************/
void USART_OverSampling8Cmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR1 |= CTLR1_OVER8_Set;
  }
  else
  {
    USARTx->CTLR1 &= CTLR1_OVER8_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_OneBitMethodCmd
* Description    : Enables or disables the USART's one bit sampling method.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.    
* Return         : None
*******************************************************************************/
void USART_OneBitMethodCmd(USART_TypeDef* USARTx, FunctionalState NewState)
{
  if (NewState != DISABLE)
  {
    USARTx->CTLR3 |= CTLR3_ONEBITE_Set;
  }
  else
  {
    USARTx->CTLR3 &= CTLR3_ONEBITE_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_IrDAConfig
* Description    : Configures the USART's IrDA interface.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_IrDAMode: specifies the IrDA mode.
*                    USART_IrDAMode_LowPower.
*                    USART_IrDAMode_Normal.
* Return         : None
*******************************************************************************/
void USART_IrDAConfig(USART_TypeDef* USARTx, uint16_t USART_IrDAMode)
{ 
  USARTx->CTLR3 &= CTLR3_IRLP_Mask;
  USARTx->CTLR3 |= USART_IrDAMode;
}

/*******************************************************************************
* Function Name  : USART_IrDACmd
* Description    : Enables or disables the USART's IrDA interface.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  NewState: ENABLE or DISABLE.   
* Return         : None
*******************************************************************************/
void USART_IrDACmd(USART_TypeDef* USARTx, FunctionalState NewState)
{ 
  if (NewState != DISABLE)
  {
    USARTx->CTLR3 |= CTLR3_IREN_Set;
  }
  else
  {
    USARTx->CTLR3 &= CTLR3_IREN_Reset;
  }
}

/*******************************************************************************
* Function Name  : USART_GetFlagStatus
* Description    : Checks whether the specified USART flag is set or not.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_FLAG: specifies the flag to check.
*                    USART_FLAG_CTS: CTS Change flag.
*                    USART_FLAG_LBD: LIN Break detection flag.
*                    USART_FLAG_TXE: Transmit data register empty flag.
*                    USART_FLAG_TC: Transmission Complete flag.
*                    USART_FLAG_RXNE: Receive data register not empty flag.
*                    USART_FLAG_IDLE: Idle Line detection flag.
*                    USART_FLAG_ORE: OverRun Error flag.
*                    USART_FLAG_NE: Noise Error flag.
*                    USART_FLAG_FE: Framing Error flag.
*                    USART_FLAG_PE: Parity Error flag.
* Return         : bitstatus: SET or RESET.
*******************************************************************************/
FlagStatus USART_GetFlagStatus(USART_TypeDef* USARTx, uint16_t USART_FLAG)
{
  FlagStatus bitstatus = RESET;

  if (USART_FLAG == USART_FLAG_CTS)
  {
  }  
  
  if ((USARTx->STATR & USART_FLAG) != (uint16_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/*******************************************************************************
* Function Name  : USART_ClearFlag
* Description    : Clears the USARTx's pending flags.
* Input          : USARTx: where x can be 1, 2, 3 to select the USART peripheral.
*                  USART_FLAG: specifies the flag to clear.
*                    USART_FLAG_CTS: CTS Change flag.
*                    USART_FLAG_LBD: LIN Break detection flag.
*                    USART_FLAG_TC: Transmission Complete flag.
*                    USART_FLAG_RXNE: Receive data register not empty flag.
* Return         : None
*******************************************************************************/
void USART_ClearFlag(USART_TypeDef* USARTx, uint16_t USART_FLAG)
{
  if ((USART_FLAG & USART_FLAG_CTS) == USART_FLAG_CTS)
  {
  } 
   
  USARTx->STATR = (uint16_t)~USART_FLAG;
}

